; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	infrared1 - mode
	image0 - mode
	infrared2 - mode
	Star5 - direction
	Star6 - direction
	GroundStation2 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star9 - direction
	Star7 - direction
	GroundStation8 - direction
	Star4 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star9)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 Star1)
	(supports instrument2 image0)
	(supports instrument2 infrared1)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument3 infrared2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument5 image0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star7)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument7 image0)
	(supports instrument7 infrared2)
	(supports instrument7 infrared1)
	(calibration_target instrument7 Star7)
	(calibration_target instrument7 GroundStation8)
	(calibration_target instrument7 Star9)
	(supports instrument8 infrared2)
	(calibration_target instrument8 Star7)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star1)
	(supports instrument9 infrared1)
	(supports instrument9 image0)
	(calibration_target instrument9 GroundStation8)
	(supports instrument10 infrared2)
	(supports instrument10 image0)
	(supports instrument10 infrared1)
	(calibration_target instrument10 Star4)
	(supports instrument11 infrared2)
	(supports instrument11 infrared1)
	(supports instrument11 image0)
	(calibration_target instrument11 Star4)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star14)
)
(:goal (and
	(pointing satellite0 Star1)
	(pointing satellite5 Star14)
	(have_image Phenomenon10 image0)
	(have_image Star11 image0)
	(have_image Phenomenon12 image0)
	(have_image Star13 infrared2)
	(have_image Star14 infrared2)
))

)

; plan
1. (turn_to satellite4 groundstation8 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 groundstation8)
   goals met: 1 of 7
2. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 1 of 7
3. (calibrate satellite4 instrument7 groundstation8)
   added: (calibrated instrument7)
   goals met: 1 of 7
4. (turn_to satellite4 phenomenon12 groundstation8)
   deleted: (pointing satellite4 groundstation8)
   added: (pointing satellite4 phenomenon12)
   goals met: 1 of 7
5. (take_image satellite4 phenomenon12 instrument7 image0)
   added: (have_image phenomenon12 image0)
   goals met: 2 of 7
6. (turn_to satellite4 phenomenon10 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon10)
   goals met: 2 of 7
7. (turn_to satellite0 star1 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star1)
   goals met: 3 of 7
8. (take_image satellite4 phenomenon10 instrument7 image0)
   added: (have_image phenomenon10 image0)
   goals met: 4 of 7
9. (turn_to satellite4 star11 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 star11)
   goals met: 4 of 7
10. (take_image satellite4 star11 instrument7 image0)
   added: (have_image star11 image0)
   goals met: 5 of 7
11. (turn_to satellite4 star13 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 star13)
   goals met: 5 of 7
12. (take_image satellite4 star13 instrument7 infrared2)
   added: (have_image star13 infrared2)
   goals met: 6 of 7
13. (turn_to satellite4 star14 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 star14)
   goals met: 6 of 7
14. (take_image satellite4 star14 instrument7 infrared2)
   added: (have_image star14 infrared2)
   goals met: 7 of 7
